[{"title":"The fog lifting and changing the view from my house between 8am and 10am"},{"title":"AITA for refusing to pay back my cousin after my baby ruined her blouse?"},{"title":"I was reading in bed last night when I realized my husband and our foster kittens were all fast asleep like this"},{"title":"What is the best video game for couples to play?"},{"title":"Does anyone else stay up at night because they feel if they go to sleep then they havent gotten enough free time at home?"},{"title":"Only allowed four plants...here's one."},{"title":"Why is this even a debate."},{"title":"TIL about Marion Stokes, a Philadelphia woman who began taping whatever was on television in 1979 and didn't stop until her death in 2012.. The 71,000 VHS and Betamax tapes she made are the most complete collection preserving this era of TV. They are being digitized by the Internet Archive."},{"title":"people waiting in lines to kill a quest mob in World of Warcraft Classic"},{"title":"SrGrafo into the Comic-Verse #4"},{"title":"Jerry been through some shit"},{"title":"Gluten Does Not Induce Gastrointestinal Symptoms in Healthy Volunteers: A Double-Blind Randomized Placebo Trial"},{"title":"Trump keeps complaining that he never suggested destroying hurricanes with bombs, but there's reportedly a White House memo that proves he said it"},{"title":"The \"Millennial as viewed from Gen Z\" starterpack"},{"title":"TFW you lose at your own game"},{"title":"Is being short really that bad"},{"title":"Reddit recently accepted an $150 million investment from a Chinese company, Tencent. Now, r/Hong_Kong, a pro china subreddit with only 1.6k subscribers, shows up first when searching for r/HongKong. r/HongKong doesnt even show up when typing a search."},{"title":"North Dakota farmer says if Trump ‘doesn’t lose 100 percent’ of his farm belt support over trade war ‘people are kind of crazy’"},{"title":"Being proud of your race is lame because you had no choice of which race you are."},{"title":"Uhhh"},{"title":"Harry Maguire attempt at building up"},{"title":"[TMZ Sports] DeMarcus Cousins Audio Allegedly Threatening to Shoot Baby Mama Before Wedding"},{"title":"One day you’ll stop being asked what you want to be when you grow up, and instead be asked what you wanted to be."},{"title":"Graphene-lined clothing could prevent mosquito bites, suggests a new study, which shows that graphene sheets can block the signals mosquitos use to identify a blood meal, enabling a new chemical-free approach to mosquito bite prevention. Skin covered by graphene oxide films didn’t get a single bite."},{"title":"[MA] I’m a sixteen year old who’s house was broken into when I was home alone by four people, pistol whipped, beat and robbed. My parents do not want me to testify and help police, I do, so this doesn’t happen to anyone else. May I talk to police and testify without their permission?"}]